<?php

 //*
 //* *
 //* * *
 //* * * *
 //* * * * *
 //* * * * *
 //* * * *
 //* * *
 //* *
 //*

//Завъртаме първият цикъл, който ще следи редовете(5 на брой):
for ($i=0; $i<=5; $i++){
    //Вторият цикъл ще отпечатва символи '*', докато j=k:
    for($j=0; $j<=$i; $j++){
        //Отпечатваме символите:
        echo '*';
    }
    //Минаваме на следващ ред:
  echo '<br/> ';
}
//Тук разликата е само във втория for цикъл, който започва от стойност 5
//прави проверка и извежда символи '*', а след като j=k, намаля стойността на j с 1.
for ($k=0; $k<=5; $k++){
    for($j=5; $j>=$k; $j--){
        echo '*';
    }
  echo '<br/> ';
}
