<?php
//Триъгълници на Флоид с 5,10,21 реда.
//Използваме вложени цикли for,запощо имаме редове и колони
//Даваме начална стойност на променливата, която ще се отпечатва
$num5=1;
//започваме с редовете, от 1 до 5
for ($i=1;$i<=5;$i++){
    //на всеки ред отпечатваме толкова числа, колкото е стойностт на i;
    for($j=1;$j<=$i;$j++){
    // Викаме променливата за визуалнизация и я инкрементираме с 1:    
        echo $num5;
        $num5++;
        
    }
    //минаваме на следващ ред
    echo '<br />';
}
//За 10 и 21 копи и пейст :))
echo'<br />';
$num10=1;
for ($i=1;$i<=10;$i++){
    for($j=1;$j<=$i;$j++){
        echo $num10;
        $num10++;
        
    }
    echo '<br />';
}
echo '<br />';
$num21=1;
for ($i=1;$i<=21;$i++){
    for($j=1;$j<=$i;$j++){
        echo $num21;
        $num21++;
        
    }
    echo '<br />';
}